meeting/agenda/2023/11-14.org
:PROPERTIES:
:ID:       0B50010A-32D9-4B6C-9DF1-1B97ABD3C4F7
:END:
#+title: QT4 CG Meeting 054 Agenda 2023-11-14
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/11-07.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
14 November,
the following meeting is scheduled for
21 November.

Any regrets for the following meeting?

** Review of open action items [1/8]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”
+ [ ] QT4CG-052-01: MP to create a proposal for a ~csv-row-record-creation~ function
+ [ ] QT4CG-052-02: MP to open an issue about supporting comment lines.
+ [ ] QT4CG-052-03: MP to make the changes agreed to #719.
+ [ ] QT4CG-052-04: MP to open an issue about consistency in the names of record types
+ [ ] QT4CG-052-05: MK to rename the ~hexBinary-equal~ function to ~binary-equal~?
+ [ ] QT4CG-052-06: MK to consider the editorial question of “promotion” for the symmetric relations.
+ [X] QT4CG-052-07: NW to move ~fn:invisible-xml~ to the section on parsing and serialization functions

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-824][#824]]: 799 errors in examples; 738 section heading for fn:op
+ PR [[https://qt4cg.org/dashboard/#pr-823][#823]]: 712 Extend array:sort to align with fn:sort
+ PR [[https://qt4cg.org/dashboard/#pr-794][#794]]: 216: fn:unparsed-text: End-of-line characters
+ PR [[https://qt4cg.org/dashboard/#pr-761][#761]]: 554/754 Simplify the new transitive-closure function
+ PR [[https://qt4cg.org/dashboard/#pr-719][#719]]: 413: Spec for CSV-related functions

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/747][#747]]: QName literals
+ Issue [[https://github.com/qt4cg/qtspecs/issues/743][#743]]: Extend enumeration types to allow values other than strings

*** XSLT focused
:PROPERTIES:
:CUSTOM_ID: xslt-focused
:END:

The following PRs appear to be candidates for a future XSLT-focussed
meeting.

+ PR [[https://qt4cg.org/dashboard/#pr-470][#470]]: 369: add fixed-prefixes attribute in XSLT
+ PR [[https://qt4cg.org/dashboard/#pr-412][#412]]: 409, QT4CG-027-01: xsl:next-match

These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/742][#742]]: xsl:function-library: keep, drop, or refine?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/169][#169]]: Handling of duplicate keys in xsl:map
+ Issue [[https://github.com/qt4cg/qtspecs/issues/168][#168]]: XSLT Extension Instructions invoking Named Templates

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-828][#828]]: 516 Add position argument to HOF callbacks
+ PR [[https://qt4cg.org/dashboard/#pr-798][#798]]: 479: fn:deep-equal: Input order
+ PR [[https://qt4cg.org/dashboard/#pr-795][#795]]: 655: fn:sort-with
+ PR [[https://qt4cg.org/dashboard/#pr-737][#737]]: 295: Boost the capability of recursive record types
+ PR [[https://qt4cg.org/dashboard/#pr-736][#736]]: 730: Clarify (and correct) rules for maps as instances of function types
+ PR [[https://qt4cg.org/dashboard/#pr-529][#529]]: 528: revision of json(), and renaming to elements-to-maps()

*** Proposed for V4.0
:PROPERTIES:
:CUSTOM_ID: proposed-40
:END:

The following issues are labled “proposed for V4.0”.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]]: Generators in XPath
+ Issue [[https://github.com/qt4cg/qtspecs/issues/689][#689]]: fn:stack-trace: keep or drop?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/583][#583]]: array:replace(), etc
+ Issue [[https://github.com/qt4cg/qtspecs/issues/340][#340]]: fn:format-number: Specifying decimal format
+ Issue [[https://github.com/qt4cg/qtspecs/issues/260][#260]]: array:index-of
+ Issue [[https://github.com/qt4cg/qtspecs/issues/91][#91]]: name of map:substitute
+ Issue [[https://github.com/qt4cg/qtspecs/issues/33][#33]]: json parsing number type option
+ Issue [[https://github.com/qt4cg/qtspecs/issues/31][#31]]: Extend FLWOR expressions to maps

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #795: 655: fn:sort-with
:PROPERTIES:
:CUSTOM_ID: pr-795
:END:
See PR [[https://qt4cg.org/dashboard/#pr-795][#795]].
** PR #736: 730: Clarify (and correct) rules for maps as instances of function types
:PROPERTIES:
:CUSTOM_ID: pr-736
:END:
See PR [[https://qt4cg.org/dashboard/#pr-736][#736]].
** PR #828: 516 Add position argument to HOF callbacks
:PROPERTIES:
:CUSTOM_ID: pr-828
:END:
See PR [[https://qt4cg.org/dashboard/#pr-828][#828]].
** Issue #716: Generators in XPath
:PROPERTIES:
:CUSTOM_ID: iss-716
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/716][#716]].
** Issue #340: fn:format-number: Specifying decimal format
:PROPERTIES:
:CUSTOM_ID: iss-340
:END:
See issue [[https://github.com/qt4cg/qtspecs/issues/340][#340]].
** PR #798: 479: fn:deep-equal: Input order
:PROPERTIES:
:CUSTOM_ID: pr-798
:END:
See PR [[https://qt4cg.org/dashboard/#pr-798][#798]].

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:


