meeting/agenda/2023/11-14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 054 Agenda 2023-11-14</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 054 Agenda 2023-11-14</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (17:00CEST, 11:00EDT, 08:00PDT).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2023/11-07.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for
14 November,
the following meeting is scheduled for
21 November.
</p>

<p>
Any regrets for the following meeting?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[1/8]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-052-02: NW to consider how to schedule an “editor’s meeting”</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-052-01: MP to create a proposal for a <code>csv-row-record-creation</code> function</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-052-02: MP to open an issue about supporting comment lines.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-052-03: MP to make the changes agreed to #719.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-052-04: MP to open an issue about consistency in the names of record types</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-052-05: MK to rename the <code>hexBinary-equal</code> function to <code>binary-equal</code>?</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-052-06: MK to consider the editorial question of “promotion” for the symmetric relations.</li>
<li class="on"><code>[X]</code> QT4CG-052-07: NW to move <code>fn:invisible-xml</code> to the section on parsing and serialization functions</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.1.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-824">#824</a>: 799 errors in examples; 738 section heading for fn:op</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-823">#823</a>: 712 Extend array:sort to align with fn:sort</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-794">#794</a>: 216: fn:unparsed-text: End-of-line characters</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-761">#761</a>: 554/754 Simplify the new transitive-closure function</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-719">#719</a>: 413: Spec for CSV-related functions</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.2.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/747">#747</a>: QName literals</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/743">#743</a>: Extend enumeration types to allow values other than strings</li>
</ul>
</div>
</div>

<div id="outline-container-xslt-focused" class="outline-4">
<h4 id="xslt-focused"><span class="section-number-4">1.6.3.</span> XSLT focused</h4>
<div class="outline-text-4" id="text-xslt-focused">
<p>
The following PRs appear to be candidates for a future XSLT-focussed
meeting.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-470">#470</a>: 369: add fixed-prefixes attribute in XSLT</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-412">#412</a>: 409, QT4CG-027-01: xsl:next-match</li>
</ul>

<p>
These issues identify the XSLT-focused changes that have been made to
the specifications but which have not been established by the
community group as the status quo.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/742">#742</a>: xsl:function-library: keep, drop, or refine?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/169">#169</a>: Handling of duplicate keys in xsl:map</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/168">#168</a>: XSLT Extension Instructions invoking Named Templates</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-828">#828</a>: 516 Add position argument to HOF callbacks</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-798">#798</a>: 479: fn:deep-equal: Input order</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-795">#795</a>: 655: fn:sort-with</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-737">#737</a>: 295: Boost the capability of recursive record types</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-736">#736</a>: 730: Clarify (and correct) rules for maps as instances of function types</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-529">#529</a>: 528: revision of json(), and renaming to elements-to-maps()</li>
</ul>
</div>
</div>

<div id="outline-container-proposed-40" class="outline-4">
<h4 id="proposed-40"><span class="section-number-4">1.6.5.</span> Proposed for V4.0</h4>
<div class="outline-text-4" id="text-proposed-40">
<p>
The following issues are labled “proposed for V4.0”.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>: Generators in XPath</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/689">#689</a>: fn:stack-trace: keep or drop?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/583">#583</a>: array:replace(), etc</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/340">#340</a>: fn:format-number: Specifying decimal format</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/260">#260</a>: array:index-of</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/91">#91</a>: name of map:substitute</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/33">#33</a>: json parsing number type option</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/31">#31</a>: Extend FLWOR expressions to maps</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-795" class="outline-3">
<h3 id="pr-795"><span class="section-number-3">2.1.</span> PR #795: 655: fn:sort-with</h3>
<div class="outline-text-3" id="text-pr-795">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-795">#795</a>.
</p>
</div>
</div>
<div id="outline-container-pr-736" class="outline-3">
<h3 id="pr-736"><span class="section-number-3">2.2.</span> PR #736: 730: Clarify (and correct) rules for maps as instances of function types</h3>
<div class="outline-text-3" id="text-pr-736">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-736">#736</a>.
</p>
</div>
</div>
<div id="outline-container-pr-828" class="outline-3">
<h3 id="pr-828"><span class="section-number-3">2.3.</span> PR #828: 516 Add position argument to HOF callbacks</h3>
<div class="outline-text-3" id="text-pr-828">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-828">#828</a>.
</p>
</div>
</div>
<div id="outline-container-iss-716" class="outline-3">
<h3 id="iss-716"><span class="section-number-3">2.4.</span> Issue #716: Generators in XPath</h3>
<div class="outline-text-3" id="text-iss-716">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/716">#716</a>.
</p>
</div>
</div>
<div id="outline-container-iss-340" class="outline-3">
<h3 id="iss-340"><span class="section-number-3">2.5.</span> Issue #340: fn:format-number: Specifying decimal format</h3>
<div class="outline-text-3" id="text-iss-340">
<p>
See issue <a href="https://github.com/qt4cg/qtspecs/issues/340">#340</a>.
</p>
</div>
</div>
<div id="outline-container-pr-798" class="outline-3">
<h3 id="pr-798"><span class="section-number-3">2.6.</span> PR #798: 479: fn:deep-equal: Input order</h3>
<div class="outline-text-3" id="text-pr-798">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-798">#798</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>